alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4200.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GPDMA0_CH0</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<headerStructName>GPDMA0_CH0_1</headerStructName>
			<baseAddress>0x50014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x55</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SAR</name>
					<description>Source Address Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SAR</name>
							<description>Current Source Address of DMA transfer</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAR</name>
					<description>Destination Address Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DAR</name>
							<description>Current Destination address of DMA transfer</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LLP</name>
					<description>Linked List Pointer Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOC</name>
							<description>Starting Address In Memory</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLL</name>
					<description>Control Register Low</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00304801</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LLP_SRC_EN</name>
							<description>Linked List Pointer for Source Enable</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LLP_DST_EN</name>
							<description>Linked List Pointer for Destination Enable</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TT_FC</name>
							<description>Transfer Type and Flow Control</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DST_SCATTER_EN</name>
							<description>Destination scatter enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scatter disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scatter enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC_GATHER_EN</name>
							<description>Source gather enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Gather disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Gather enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC_MSIZE</name>
							<description>Source Burst Transaction Length</description>
							<lsb>14</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DEST_MSIZE</name>
							<description>Destination Burst Transaction Length</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SINC</name>
							<description>Source Address Increment</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Increment</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Decrement</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>No change</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DINC</name>
							<description>Destination Address Increment</description>
							<lsb>7</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Increment</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Decrement</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>No change</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC_TR_WIDTH</name>
							<description>Source Transfer Width</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DST_TR_WIDTH</name>
							<description>Destination Transfer Width</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INT_EN</name>
							<description>Interrupt Enable Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLH</name>
					<description>Control Register High</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>Done bit</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BLOCK_TS</name>
							<description>Block Transfer Size</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SSTAT</name>
					<description>Source Status Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSTAT</name>
							<description>Source Status</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTAT</name>
					<description>Destination Status Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSTAT</name>
							<description>Destination Status</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SSTATAR</name>
					<description>Source Status Address Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSTATAR</name>
							<description>Source Status Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTATAR</name>
					<description>Destination Status Address Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSTATAR</name>
							<description>Destination Status Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGL</name>
					<description>Configuration Register Low</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<resetValue>0x00000E00</resetValue>
					<resetMask>0xFFFFFF0F</resetMask>
					<fields>
						<field>
							<name>RELOAD_DST</name>
							<description>Automatic Destination Reload</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RELOAD_SRC</name>
							<description>Automatic Source Reload</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAX_ABRST</name>
							<description>Maximum AMBA Burst Length</description>
							<lsb>20</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRC_HS_POL</name>
							<description>Source Handshaking Interface Polarity</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DST_HS_POL</name>
							<description>Destination Handshaking Interface Polarity</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK_B</name>
							<description>Bus Lock Bit</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK_CH</name>
							<description>Channel Lock Bit</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK_B_L</name>
							<description>Bus Lock Level</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Over complete DMA transfer</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Over complete DMA block transfer</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Over complete DMA transaction</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK_CH_L</name>
							<description>Channel Lock Level</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Over complete DMA transfer</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Over complete DMA block transfer</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Over complete DMA transaction</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS_SEL_SRC</name>
							<description>Source Software or Hardware Handshaking Select</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Hardware handshaking interface. Software-initiated transaction requests are ignored.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software handshaking interface. Hardware-initiated transaction requests are ignored.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS_SEL_DST</name>
							<description>Destination Software or Hardware Handshaking Select</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Hardware handshaking interface. Software-initiated transaction requests are ignored.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software handshaking interface. Hardware- initiated transaction requests are ignored.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIFO_EMPTY</name>
							<description>Indicates if there is data left in the channel FIFO</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel FIFO empty</description>
									<value>#1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel FIFO not empty</description>
									<value>#0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH_SUSP</name>
							<description>Channel Suspend</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not suspended.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Suspend DMA transfer from the source.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH_PRIOR</name>
							<description>Channel priority</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGH</name>
					<description>Configuration Register High</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<resetValue>0x00000004</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEST_PER</name>
							<description>Destination Peripheral</description>
							<lsb>11</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRC_PER</name>
							<description>Source Peripheral</description>
							<lsb>7</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SS_UPD_EN</name>
							<description>Source Status Update Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DS_UPD_EN</name>
							<description>Destination Status Update Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PROTCTL</name>
							<description>Protection Control</description>
							<lsb>2</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FIFO_MODE</name>
							<description>FIFO Mode Select</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Space/data available for single AHB transfer of the specified transfer width.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Data available is greater than or equal to half the FIFO depth for destination transfers and space available is greater than half the fifo depth for source transfers. The exceptions are at the end of a burst transaction request or at the end of a block transfer.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCMODE</name>
							<description>Flow Control Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Source transaction requests are serviced when they occur. Data pre-fetching is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Source transaction requests are not serviced until a destination transaction request occurs. In this mode, the amount of data transferred from the source is limited so that it is guaranteed to be transferred to the destination prior to block termination by the destination. Data pre-fetching is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SGR</name>
					<description>Source Gather Register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SGC</name>
							<description>Source gather count</description>
							<lsb>20</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SGI</name>
							<description>Source gather interval</description>
							<lsb>0</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSR</name>
					<description>Destination Scatter Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSC</name>
							<description>Destination scatter count</description>
							<lsb>20</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSI</name>
							<description>Destination scatter interval</description>
							<lsb>0</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
