alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4200.svd
				<register>
					<name>LDCMP1</name>
					<description>LED Compare Register 1</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_LD4</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD5</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD6</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LDA_TSCOM</name>
							<description>Compare Value for LED COLA / Common Compare Value for Touch-sense Pad Turns</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCMP0</name>
					<description>Touch-sense Compare Register 0</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_TS0</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS1</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS2</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS3</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCMP1</name>
					<description>Touch-sense Compare Register 1</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_TS4</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS5</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS6</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS7</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>USB0</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<headerStructName>USB</headerStructName>
			<baseAddress>0x50040000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x040000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB0_0</name>
				<description>Universal Serial Bus (Module 0)</description>
				<value>107</value>
			</interrupt>
			<registers>
				<register>
					<name>GAHBCFG</name>
					<description>AHB Configuration Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GlblIntrMsk</name>
							<description>Global Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mask the interrupt assertion to the application.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Unmask the interrupt assertion to the application.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HBstLen</name>
							<description>Burst Length/Type</description>
							<lsb>1</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Single</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>INCR</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>INCR4</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>INCR8</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>INCR16</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAEn</name>
							<description>DMA Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Core operates in Slave mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Core operates in a DMA mode</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NPTxFEmpLvl</name>
							<description>Non-Periodic TxFIFO Empty Level</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DIEPINTx.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is half empty</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DIEPINTx.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is completely empty</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHBSingle</name>
							<description>AHB Single Support</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The remaining data in a transfer is sent using INCR burst size. This is the default mode.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The remaining data in a transfer is sent using single burst size.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GUSBCFG</name>
					<description>USB Configuration Register</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00001440</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOutCal</name>
							<description>FS Timeout Calibration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PHYSel</name>
							<description>USB 1.1 Full-Speed Serial Transceiver Select</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value2</name>
									<description>USB 1.1 full-speed serial transceiver</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBTrdTim</name>
							<description>USB Turnaround Time</description>
							<lsb>10</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxEndDelay</name>
							<description>Tx End Delay</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Introduce Tx end delay timers</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ForceDevMode</name>
							<description>Force Device Mode</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Force Device Mode</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTP</name>
							<description>Corrupt Tx packet</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GRSTCTL</name>
					<description>Reset Register</description>
					<addressOffset>0x0010</addressOffset>
					<size>32</size>
					<resetValue>0x10000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSftRst</name>
							<description>Core Soft Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFFlsh</name>
							<description>RxFIFO Flush</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxFFlsh</name>
							<description>TxFIFO Flush</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxFNum</name>
							<description>TxFIFO Number</description>
							<lsb>6</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Tx FIFO 0 flush in device mode</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Tx FIFO 1 flush in device mode</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Tx FIFO 2 flush in device mode</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Tx FIFO 15 flush in device mode</description>
									<value>0x0F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Flush all the transmit FIFOs in device or host mode.</description>
									<value>0x10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAReq</name>
							<description>DMA Request Signal</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AHBIdle</name>
							<description>AHB Master Idle</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GINTSTS</name>
					<description>Interrupt Register</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x14000020</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CurMod</name>
							<description>Current Mode of Operation</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Device mode</description>
									<value>#0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Sof</name>
							<description>Start of Frame</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFLvl</name>
							<description>RxFIFO Non-Empty</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GINNakEff</name>
							<description>Global IN Non-Periodic NAK Effective</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GOUTNakEff</name>
							<description>Global OUT NAK Effective</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ErlySusp</name>
							<description>Early Suspend</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBSusp</name>
							<description>USB Suspend</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBRst</name>
							<description>USB Reset</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EnumDone</name>
							<description>Enumeration Done</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISOOutDrop</name>
							<description>Isochronous OUT Packet Dropped Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOPF</name>
							<description>End of Periodic Frame Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IEPInt</name>
							<description>IN Endpoints Interrupt</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OEPInt</name>
							<description>OUT Endpoints Interrupt</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>incompISOIN</name>
							<description>Incomplete Isochronous IN Transfer</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incomplSOOUT</name>
							<description>Incomplete Isochronous OUT Transfer</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WkUpInt</name>
							<description>Resume/Remote Wakeup Detected Interrupt</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GINTMSK</name>
					<description>Interrupt Mask Register</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SofMsk</name>
							<description>Start of Frame Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFLvlMsk</name>
							<description>Receive FIFO Non-Empty Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GINNakEffMsk</name>
							<description>Global Non-periodic IN NAK Effective Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GOUTNakEffMsk</name>
							<description>Global OUT NAK Effective Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ErlySuspMsk</name>
							<description>Early Suspend Mask</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBSuspMsk</name>
							<description>USB Suspend Mask</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBRstMsk</name>
							<description>USB Reset Mask</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EnumDoneMsk</name>
							<description>Enumeration Done Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISOOutDropMsk</name>
							<description>Isochronous OUT Packet Dropped Interrupt Mask</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOPFMsk</name>
							<description>End of Periodic Frame Interrupt Mask</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IEPIntMsk</name>
							<description>IN Endpoints Interrupt Mask</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OEPIntMsk</name>
							<description>OUT Endpoints Interrupt Mask</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incompISOINMsk</name>
							<description>Incomplete Isochronous IN Transfer Mask</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incomplSOOUTMsk</name>
							<description>Incomplete Isochronous OUT Transfer Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WkUpIntMsk</name>
							<description>Resume/Remote Wakeup Detected Interrupt Mask</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GRXSTSR</name>
					<description>Receive Status Debug Read Register</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPNum</name>
							<description>Endpoint Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BCnt</name>
							<description>Byte Count</description>
							<lsb>4</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DPID</name>
							<description>Data PID</description>
							<lsb>15</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PktSts</name>
							<description>Packet Status</description>
							<lsb>17</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Global OUT NAK (triggers an interrupt)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>OUT data packet received</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>OUT transfer completed (triggers an interrupt)</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>SETUP transaction completed (triggers an interrupt)</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>SETUP data packet received</description>
									<value>#0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FN</name>
							<description>Frame Number</description>
							<lsb>21</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
