alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4200.svd
				<register>
					<name>DOEPINT</name>
					<description>Device Endpoint Interrupt Register</description>
					<addressOffset>0x208</addressOffset>
					<size>32</size>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferCompl</name>
							<description>Transfer Completed Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDisbld</name>
							<description>Endpoint Disabled Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErr</name>
							<description>AHB Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SetUp</name>
							<description>SETUP Phase Done</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTTknEPdis</name>
							<description>OUT Token Received When Endpoint Disabled</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>StsPhseRcvd</name>
							<description>Status Phase Received For Control Write</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Back2BackSETup</name>
							<description>Back-to-Back SETUP Packets Received</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BNAIntr</name>
							<description>BNA (Buffer Not Available) Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktDrpSts</name>
							<description>Packet Dropped Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BbleErrIntrpt</name>
							<description>BbleErr (Babble Error) interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NAKIntrpt</name>
							<description>NAK interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NYETIntrpt</name>
							<description>NYET interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPTSIZ_ISO</name>
					<description>Device Endpoint Transfer Size Register [ISO]</description>
					<addressOffset>0x210</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferSize</name>
							<description>Transfer Size</description>
							<lsb>0</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktCnt</name>
							<description>Packet Count</description>
							<lsb>19</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxDPID</name>
							<description>Received Data PID</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPTSIZ_CONTROL</name>
					<description>Device Endpoint Transfer Size Register [CONT]</description>
					<alternateRegister>DOEPTSIZ_ISO</alternateRegister>
					<addressOffset>0x210</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferSize</name>
							<description>Transfer Size</description>
							<lsb>0</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktCnt</name>
							<description>Packet Count</description>
							<lsb>19</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUPCnt</name>
							<description>SETUP Packet Count</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 packet</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 packets</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>3 packets</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPDMA</name>
					<description>Device Endpoint DMA Address Register</description>
					<addressOffset>0x214</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DMAAddr</name>
							<description>DMA Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPDMAB</name>
					<description>Device Endpoint DMA Buffer Address Register</description>
					<addressOffset>0x21C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DMABufferAddr</name>
							<description>DMA Buffer Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
