alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4200.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="USIC0_CH0">
			<name>USIC0_CH1</name>
			<description>Universal Serial Interface Controller 0</description>
			<groupName>USIC</groupName>
			<baseAddress>0x40030200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USIC0_CH0">
			<name>USIC1_CH0</name>
			<description>Universal Serial Interface Controller 1</description>
			<groupName>USIC</groupName>
			<baseAddress>0x48020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USIC0_CH0">
			<name>USIC1_CH1</name>
			<description>Universal Serial Interface Controller 1</description>
			<groupName>USIC</groupName>
			<baseAddress>0x48020200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>CAN</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CAN0_0</name>
				<description>MultiCAN</description>
				<value>76</value>
			</interrupt>
			<interrupt>
				<name>CAN0_1</name>
				<description>MultiCAN</description>
				<value>77</value>
			</interrupt>
			<interrupt>
				<name>CAN0_2</name>
				<description>MultiCAN</description>
				<value>78</value>
			</interrupt>
			<interrupt>
				<name>CAN0_3</name>
				<description>MultiCAN</description>
				<value>79</value>
			</interrupt>
			<interrupt>
				<name>CAN0_4</name>
				<description>MultiCAN</description>
				<value>80</value>
			</interrupt>
			<interrupt>
				<name>CAN0_5</name>
				<description>MultiCAN</description>
				<value>81</value>
			</interrupt>
			<interrupt>
				<name>CAN0_6</name>
				<description>MultiCAN</description>
				<value>82</value>
			</interrupt>
			<interrupt>
				<name>CAN0_7</name>
				<description>MultiCAN</description>
				<value>83</value>
			</interrupt>
			<registers>
				<register>
					<name>CLC</name>
					<description>CAN Clock Control Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBWE</name>
							<description>Module Suspend Bit Write Enable for OCDS</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x002BC000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Define the module as a 32-bit module.</description>
									<value>0xC0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>CAN Fractional Divider Register</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM</name>
							<description>Suspend Mode</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SC</name>
							<description>Suspend Control</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SUSACK</name>
							<description>Suspend Mode Acknowledge</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SUSREQ</name>
							<description>Suspend Mode Request</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ENHW</name>
							<description>Enable Hardware Clock Control</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISCLK</name>
							<description>Disable Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>LIST[%s]</name>
					<description>List Register</description>
					<addressOffset>0x0100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>BEGIN</name>
							<description>List Begin</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>END</name>
							<description>List End</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIZE</name>
							<description>List Size</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMPTY</name>
							<description>List Empty Indication</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>At least one message object is allocated to list i.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>No message object is allocated to the list x. List x is empty.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>MSPND[%s]</name>
					<description>Message Pending Register</description>
					<addressOffset>0x0140</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PND</name>
							<description>Message Pending</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>MSID[%s]</name>
					<description>Message Index Register</description>
					<addressOffset>0x0180</addressOffset>
					<size>32</size>
					<resetValue>0x00000020</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INDEX</name>
							<description>Message Pending Index</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSIMASK</name>
					<description>Message Index Mask Register</description>
					<addressOffset>0x01C0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IM</name>
							<description>Message Index Mask</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PANCTR</name>
					<description>Panel Control Register</description>
					<addressOffset>0x01C4</addressOffset>
					<size>32</size>
					<resetValue>0x00000301</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PANCMD</name>
							<description>Panel Command</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSY</name>
							<description>Panel Busy Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Panel has finished command and is ready to accept a new command.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Panel operation is in progress.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RBUSY</name>
							<description>Result Busy Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No update of PANAR1 and PANAR2 is scheduled by the list controller.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A list command is running (BUSY = 1) that will write results to PANAR1 and PANAR2, but the results are not yet available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PANAR1</name>
							<description>Panel Argument 1</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PANAR2</name>
							<description>Panel Argument 2</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCR</name>
					<description>Module Control Register</description>
					<addressOffset>0x01C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MPSEL</name>
							<description>Message Pending Selector</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MITR</name>
					<description>Module Interrupt Trigger Register</description>
					<addressOffset>0x01CC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IT</name>
							<description>Interrupt Trigger</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
