alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4200.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CAN_NODE0">
			<name>CAN_NODE1</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48014300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>CAN_MO0</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<headerStructName>CAN_MO</headerStructName>
			<baseAddress>0x48015000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MOFCR</name>
					<description>Message Object Function Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MMC</name>
							<description>Message Mode Control</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Standard Message Object</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Receive FIFO Base Object</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Transmit FIFO Base Object</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Transmit FIFO Slave Object</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Gateway Source Object</description>
									<value>#0100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GDFS</name>
							<description>Gateway Data Frame Send</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>TXRQ is unchanged in the destination object.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>TXRQ is set in the gateway destination object after the internal transfer from the gateway source to the gateway destination object.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDC</name>
							<description>Identifier Copy</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The identifier of the gateway source object is not copied.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The identifier of the gateway source object (after storing the received frame in the source) is copied to the gateway destination object.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLCC</name>
							<description>Data Length Code Copy</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Data length code is not copied.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Data length code of the gateway source object (after storing the received frame in the source) is copied to the gateway destination object.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DATC</name>
							<description>Data Copy</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Data fields are not copied.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Data fields in registers MODATALn and MODATAHn of the gateway source object (after storing the received frame in the source) are copied to the gateway destination.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIE</name>
							<description>Receive Interrupt Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Message receive interrupt is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Message receive interrupt is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXIE</name>
							<description>Transmit Interrupt Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Message transmit interrupt is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Message transmit interrupt is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVIE</name>
							<description>Overflow Interrupt Enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>FIFO full interrupt is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>FIFO full interrupt is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FRREN</name>
							<description>Foreign Remote Request Enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>TXRQ of message object n is set on reception of a matching Remote Frame.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>TXRQ of the message object referenced by the pointer CUR is set on reception of a matching Remote Frame.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RMM</name>
							<description>Transmit Object Remote Monitoring</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Remote monitoring is disabled: Identifier, IDE bit, and DLC of message object n remain unchanged upon the reception of a matching Remote Frame.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Remote monitoring is enabled: Identifier, IDE bit, and DLC of a matching Remote Frame are copied to transmit object n in order to monitor incoming Remote Frames.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDT</name>
							<description>Single Data Transfer</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STT</name>
							<description>Single Transmit Trial</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DLC</name>
							<description>Data Length Code</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOFGPR</name>
					<description>Message Object FIFO/Gateway Pointer Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BOT</name>
							<description>Bottom Pointer</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOP</name>
							<description>Top Pointer</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CUR</name>
							<description>Current Object Pointer</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL</name>
							<description>Object Select Pointer</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOIPR</name>
					<description>Message Object Interrupt Pointer Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXINP</name>
							<description>Receive Interrupt Node Pointer</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt output line INT_O0 is selected.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt output line INT_O1 is selected.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Interrupt output line INT_O7 is selected.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXINP</name>
							<description>Transmit Interrupt Node Pointer</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt output line INT_O0 is selected.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt output line INT_O1 is selected.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Interrupt output line INT_O7 is selected.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MPN</name>
							<description>Message Pending Number</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CFCVAL</name>
							<description>CAN Frame Counter Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOAMR</name>
					<description>Message Object Acceptance Mask Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x3FFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AM</name>
							<description>Acceptance Mask for Message Identifier</description>
							<lsb>0</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MIDE</name>
							<description>Acceptance Mask Bit for Message IDE Bit</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Message object n accepts the reception of both, standard and extended frames.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Message object n receives frames only with matching IDE bit.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODATAL</name>
					<description>Message Object Data Register Low</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DB0</name>
							<description>Data Byte 0 of Message Object n</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DB1</name>
							<description>Data Byte 1 of Message Object n</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DB2</name>
							<description>Data Byte 2 of Message Object n</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DB3</name>
							<description>Data Byte 3 of Message Object n</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODATAH</name>
					<description>Message Object Data Register High</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DB4</name>
							<description>Data Byte 4 of Message Object n</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DB5</name>
							<description>Data Byte 5 of Message Object n</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DB6</name>
							<description>Data Byte 6 of Message Object n</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DB7</name>
							<description>Data Byte 7 of Message Object n</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOAR</name>
					<description>Message Object Arbitration Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>CAN Identifier of Message Object n</description>
							<lsb>0</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier Extension Bit of Message Object n</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Message object n handles standard frames with 11-bit identifier.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Message object n handles extended frames with 29-bit identifier.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRI</name>
							<description>Priority Class</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Applicable only if TTCAN is available.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Transmit acceptance filtering is based on the list order. This means that message object n is considered for transmission only if there is no other message object with valid transmit request (MSGVAL &amp; TXEN0 &amp; TXEN1 = 1) somewhere before this object in the list.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Transmit acceptance filtering is based on the CAN identifier. This means, message object n is considered for transmission only if there is no other message object with higher priority identifier + IDE + DIR (with respect to CAN arbitration rules) somewhere in the list (see ).</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Transmit acceptance filtering is based on the list order (as PRI = 01B).</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MOCTR</name>
					<description>Message Object Control Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>RESRXPND</name>
							<description>Reset/Set Receive Pending</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETRXPND</name>
							<description>Reset/Set Receive Pending</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESTXPND</name>
							<description>Reset/Set Transmit Pending</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETTXPND</name>
							<description>Reset/Set Transmit Pending</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESRXUPD</name>
							<description>Reset/Set Receive Updating</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETRXUPD</name>
							<description>Reset/Set Receive Updating</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESNEWDAT</name>
							<description>Reset/Set New Data</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETNEWDAT</name>
							<description>Reset/Set New Data</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESMSGLST</name>
							<description>Reset/Set Message Lost</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETMSGLST</name>
							<description>Reset/Set Message Lost</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESMSGVAL</name>
							<description>Reset/Set Message Valid</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETMSGVAL</name>
							<description>Reset/Set Message Valid</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESRTSEL</name>
							<description>Reset/Set Receive/Transmit Selected</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETRTSEL</name>
							<description>Reset/Set Receive/Transmit Selected</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESRXEN</name>
							<description>Reset/Set Receive Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETRXEN</name>
							<description>Reset/Set Receive Enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESTXRQ</name>
							<description>Reset/Set Transmit Request</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETTXRQ</name>
							<description>Reset/Set Transmit Request</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESTXEN0</name>
							<description>Reset/Set Transmit Enable 0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETTXEN0</name>
							<description>Reset/Set Transmit Enable 0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESTXEN1</name>
							<description>Reset/Set Transmit Enable 1</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETTXEN1</name>
							<description>Reset/Set Transmit Enable 1</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RESDIR</name>
							<description>Reset/Set Message Direction</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETDIR</name>
							<description>Reset/Set Message Direction</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
