alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4200.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CCU40</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<headerStructName>CCU4</headerStructName>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CCU40_0</name>
				<description>Capture Compare Unit 4 (Module 0)</description>
				<value>44</value>
			</interrupt>
			<interrupt>
				<name>CCU40_1</name>
				<description>Capture Compare Unit 4 (Module 0)</description>
				<value>45</value>
			</interrupt>
			<interrupt>
				<name>CCU40_2</name>
				<description>Capture Compare Unit 4 (Module 0)</description>
				<value>46</value>
			</interrupt>
			<interrupt>
				<name>CCU40_3</name>
				<description>Capture Compare Unit 4 (Module 0)</description>
				<value>47</value>
			</interrupt>
			<registers>
				<register>
					<name>GCTRL</name>
					<description>Global Control Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRBC</name>
							<description>Prescaler Clear Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SW only</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC40 is cleared.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC41 is cleared.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC42 is cleared.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC43 is cleared.</description>
									<value>#100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCIS</name>
							<description>Prescaler Input Clock Selection</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Module clock</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU4x.ECLKA</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CCU4x.ECLKB</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CCU4x.ECLKC</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSCFG</name>
							<description>Suspend Mode Configuration</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Suspend request ignored. The module never enters in suspend</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Stops all the running slices immediately. Safe stop is not applied.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Stops the block immediately and clamps all the outputs to PASSIVE state. Safe stop is applied.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Waits for the roll over of each slice to stop and clamp the slices outputs. Safe stop is applied.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE0</name>
							<description>Slice 0 Multi Channel shadow transfer enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU4x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE1</name>
							<description>Slice 1 Multi Channel shadow transfer enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU4x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE2</name>
							<description>Slice 2 Multi Channel shadow transfer enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU4x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE3</name>
							<description>Slice 3 Multi Channel shadow transfer enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU4x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSDE</name>
							<description>Multi Channel shadow transfer request configuration</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Only the shadow transfer for period and compare values is requested</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer for the compare, period and prescaler compare values is requested</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Shadow transfer for the compare, period, prescaler and dither compare values is requested</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GSTAT</name>
					<description>Global Status Register</description>
					<addressOffset>0x0004</addressOffset>
					<size>32</size>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0I</name>
							<description>CC40 IDLE status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1I</name>
							<description>CC41 IDLE status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2I</name>
							<description>CC42 IDLE status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3I</name>
							<description>CC43 IDLE status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRB</name>
							<description>Prescaler Run Bit</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler is stopped</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GIDLS</name>
					<description>Global Idle Set</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SS0I</name>
							<description>CC40 IDLE mode set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SS1I</name>
							<description>CC41 IDLE mode set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SS2I</name>
							<description>CC42 IDLE mode set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SS3I</name>
							<description>CC43 IDLE mode set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CPRB</name>
							<description>Prescaler Run Bit Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PSIC</name>
							<description>Prescaler clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GIDLC</name>
					<description>Global Idle Clear</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CS0I</name>
							<description>CC40 IDLE mode clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CS1I</name>
							<description>CC41 IDLE mode clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CS2I</name>
							<description>CC42 IDLE mode clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CS3I</name>
							<description>CC43 IDLE mode clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SPRB</name>
							<description>Prescaler Run Bit Set</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GCSS</name>
					<description>Global Channel Set</description>
					<addressOffset>0x0010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0SE</name>
							<description>Slice 0 shadow transfer set enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0DSE</name>
							<description>Slice 0 Dither shadow transfer set enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0PSE</name>
							<description>Slice 0 Prescaler shadow transfer set enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1SE</name>
							<description>Slice 1 shadow transfer set enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1DSE</name>
							<description>Slice 1 Dither shadow transfer set enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1PSE</name>
							<description>Slice 1 Prescaler shadow transfer set enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2SE</name>
							<description>Slice 2 shadow transfer set enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2DSE</name>
							<description>Slice 2 Dither shadow transfer set enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2PSE</name>
							<description>Slice 2 Prescaler shadow transfer set enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3SE</name>
							<description>Slice 3 shadow transfer set enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3DSE</name>
							<description>Slice 3 Dither shadow transfer set enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3PSE</name>
							<description>Slice 3 Prescaler shadow transfer set enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0STS</name>
							<description>Slice 0 status bit set</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1STS</name>
							<description>Slice 1 status bit set</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2STS</name>
							<description>Slice 2 status bit set</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3STS</name>
							<description>Slice 3 status bit set</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GCSC</name>
					<description>Global Channel Clear</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0SC</name>
							<description>Slice 0 shadow transfer clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0DSC</name>
							<description>Slice 0 Dither shadow transfer clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0PSC</name>
							<description>Slice 0 Prescaler shadow transfer clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1SC</name>
							<description>Slice 1 shadow transfer clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1DSC</name>
							<description>Slice 1 Dither shadow transfer clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1PSC</name>
							<description>Slice 1 Prescaler shadow transfer clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2SC</name>
							<description>Slice 2 shadow transfer clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2DSC</name>
							<description>Slice 2 Dither shadow transfer clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2PSC</name>
							<description>Slice 2 Prescaler shadow transfer clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3SC</name>
							<description>Slice 3 shadow transfer clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3DSC</name>
							<description>Slice 3 Dither shadow transfer clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3PSC</name>
							<description>Slice 3 Prescaler shadow transfer clear</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0STC</name>
							<description>Slice 0 status bit clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1STC</name>
							<description>Slice 1 status bit clear</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2STC</name>
							<description>Slice 2 status bit clear</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3STC</name>
							<description>Slice 3 status bit clear</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
